In [1]:
# 读取csv

In [2]:
import pandas as pd

In [3]:
df = pd.read_csv('stock_data.csv')

In [4]:
df

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

In [8]:
df  = pd.read_csv('stock_data.csv',skiprows=[1,3,4])

In [9]:
df

  tickers   eps  revenue price      people
0     WMT  4.61      484    65        n.a.
1    TATA  5.60       -1  n.a.  ratan tata

In [16]:
df  = pd.read_csv('stock_data.csv',header=None,names=['aa','bb','cc','dd','ee'])

In [17]:
df

        aa             bb       cc     dd             ee
0  tickers            eps  revenue  price         people
1    GOOGL          27.82       87    845     larry page
2      WMT           4.61      484     65           n.a.
3     MSFT             -1       85     64     bill gates
4     RIL   not available       50   1023  mukesh ambani
5     TATA            5.6       -1   n.a.     ratan tata

In [20]:
df  = pd.read_csv('stock_data.csv',nrows=3)

In [21]:
df

  tickers    eps  revenue  price      people
0   GOOGL  27.82       87    845  larry page
1     WMT   4.61      484     65        n.a.
2    MSFT  -1.00       85     64  bill gates

In [22]:
# 输出csv文件

In [23]:
df

  tickers    eps  revenue  price      people
0   GOOGL  27.82       87    845  larry page
1     WMT   4.61      484     65        n.a.
2    MSFT  -1.00       85     64  bill gates

In [24]:
df.to_csv('out.csv')

In [25]:
df.to_csv('out2.csv',index=False)

In [26]:
df.to_csv('out3.csv',index=False,header=False)

In [27]:
df.to_csv('out4.csv',index=False,columns=['tickers','eps'])

In [28]:
# excel的部分

In [29]:
df = pd.read_excel('stock_data.xlsx',"Sheet1")

In [30]:
df

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

In [31]:
def convert_price(t):
    if t == 'n.a.':
        return 50
    return t

In [34]:
df = pd.read_excel('stock_data.xlsx',"Sheet1",
                  converters = {
                      
                      'price':convert_price
                  }
                  )

In [35]:
df

  tickers            eps  revenue  price         people
0   GOOGL          27.82       87    845     larry page
1     WMT           4.61      484     65           n.a.
2    MSFT             -1       85     64     bill gates
3    RIL   not available       50   1023  mukesh ambani
4    TATA            5.6       -1     50     ratan tata

In [36]:
# 写入excel 数据

In [37]:
df

  tickers            eps  revenue  price         people
0   GOOGL          27.82       87    845     larry page
1     WMT           4.61      484     65           n.a.
2    MSFT             -1       85     64     bill gates
3    RIL   not available       50   1023  mukesh ambani
4    TATA            5.6       -1     50     ratan tata

In [38]:
df2 = pd.read_csv('weather_data.csv')

In [39]:
df2

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow

In [40]:
df2.to_excel('weather_data.xlsx',sheet_name='weather',index=False)

In [41]:
df2.to_excel('weather_data2.xlsx',sheet_name='weather',index=False,startrow=3,startcol=4)

In [42]:
df

  tickers            eps  revenue  price         people
0   GOOGL          27.82       87    845     larry page
1     WMT           4.61      484     65           n.a.
2    MSFT             -1       85     64     bill gates
3    RIL   not available       50   1023  mukesh ambani
4    TATA            5.6       -1     50     ratan tata

In [43]:
df2

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow

In [44]:
with pd.ExcelWriter('combine.xlsx') as writer:
    df.to_excel(writer,sheet_name='df1')
    df2.to_excel(writer,sheet_name='df2')